---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.WallSweepType
source: html/e6e5577a-4592-6ac5-d134-643356b68ac1.htm
---
# Autodesk.Revit.DB.WallSweepInfo.WallSweepType Property

The type (either a wall sweep or a reveal).

## Syntax (C#)
```csharp
public WallSweepType WallSweepType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration